load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 500

scenarios:
  - name: Login and fetch books
    flow:
      - get:
          url: "/api/books"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2ODAzOWUwMDdmYThmMDZmY2IwOGQ0MmUiLCJpYXQiOjE3NDczODAxODAsImV4cCI6MTc0ODY3NjE4MH0.ODk2G08Xb1vC5EHeWOJbBlfOOSDn7kU-ibdg7XmC8UM"